# Dataframe

### 2차원 데이터 + 행 인덱스 + 열 인덱스
(시리즈와 비교할 떄 값이 여러개)

In [2]:
import pandas as pd
import numpy as np

In [5]:
data = {'국어' : [80, 90, 70, 30],
        '영어' : [90, 70, 60, 40],
        '수학' : [90, 60, 80, 70]
}
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [7]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),
                    columns=['국어','영어','수학'], index=index)
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [12]:
l = []
for i in range(4):
    d= {'국어':np.random.randint(40.101),
        '영어':np.random.randint(40.101),
        '수학':np.random.randint(40.101)}
    l.append(d)
l

[{'국어': 24, '영어': 12, '수학': 6},
 {'국어': 38, '영어': 6, '수학': 33},
 {'국어': 37, '영어': 7, '수학': 1},
 {'국어': 33, '영어': 37, '수학': 26}]

In [13]:
df3 = pd.DataFrame(l, index=index)
df3

    국어  영어  수학
춘향  24  12   6
몽룡  38   6  33
향단  37   7   1
방자  33  37  26

### 인덱싱

In [14]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [17]:
df['국어'] # 열선택방법
df.국어 #열선택방법2

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

- 열 인덱스, 행 인덱스

In [20]:
#df[열인덱스][행인덱스]
df['국어']['춘향'], df['국어'][0], df.국어[0], df.국어.춘향

(80, 80, 80, 80)

In [22]:
df['국어'][:2] #행인덱스는 슬라이싱 가능

춘향    80
몽룡    90
Name: 국어, dtype: int64

In [24]:
df[['국어','영어']][:2] #열인덱스는 리스트로 가능

    국어  영어
춘향  80  90
몽룡  90  70

In [25]:
df[['국어','영어']][:'향단'] #행인덱스 이름을 직접 지정하면 값 포함

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60

In [29]:
df[['국어']][:'향단'] #column에 리스트가 포함되어 있으면 dataframe

    국어
춘향  80
몽룡  90
향단  70

- loc 인덱서 :[행인덱스, 열인덱스]

In [32]:
df.loc['몽룡','국어'], df.loc['몽룡']['국어'], df.loc['몽룡'][0]

(90, 90, 90)

- iloc 인덱서 : [행숫자, 열숫자]

In [36]:
df.iloc[1,0]

90

In [37]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [39]:
df['국어']['방자'] = 75
df['영어']['방자'] = 82
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [42]:
df['과학'] = [30, 40, 50, 60]

In [43]:
df

    국어  영어  수학  과학
춘향  80  90  90  30
몽룡  90  70  60  40
향단  70  60  80  50
방자  75  82  70  60

- 열 삭제

In [49]:
del df['과학'] #열 삭제시 del

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

- 행삭제

In [50]:
df.drop(['방자']) #행 삭제시 drop

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80

In [51]:
df.drop(['방자'], inplace=True) #데이터 바꿀 떄 inplace=True사용
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80